In [62]:
import numpy as np
import pandas as pd

In [ ]:
'''


What is a DataFrame?

- A series of Pandas Series is a DataFrame.



SYNTAX:

df = pd.DataFrame(data= ,index= ,columns= )


'''

In [63]:
columns_1 = ['W','X','Y','Z']

In [64]:
index_1 = ['A','B','C','D','E']

In [65]:
from numpy.random import randint

In [67]:
# Here, we are specifying the seed value, which means for every 42 numbers the random numbers will repeat.
# We are making a matrix of 5x4 with random numbers.
np.random.seed(42)
data_1 = randint(-100,100,(5,4))
data_1

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [69]:
df = pd.DataFrame(data=data_1, index=index_1, columns=columns_1)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [7]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [8]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [9]:
type(df['W'])

pandas.core.series.Series

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df['new'] = df['W'] + df['Y']

In [12]:
df['new']

A    -6
B    94
C   -24
D    19
E   -18
Name: new, dtype: int32

In [13]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [14]:
# Removing a column from output
df.drop('new',axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [15]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [16]:
# Removing a column permanently
df = df.drop('new',axis=1)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [17]:
# U get an error when you try to choose a row, anything in axis=0
df['A']

KeyError: 'A'

In [18]:
# U get the output when u choose the column, anything in axis=1
df['Y']

A    -8
B    88
C   -26
D     3
E   -48
Name: Y, dtype: int32

In [19]:
# U get the output when u use .loc[] to choose a row, anything in axis=0
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [20]:
df.loc[['A','C']]

   W   X   Y   Z
A  2  79  -8 -86
C  2  21 -26 -13

In [21]:
# Fetching index-based location, we can use slicing too
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [22]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [23]:
df.iloc[-1]

W    30
X    49
Y   -48
Z   -99
Name: E, dtype: int32

In [24]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [25]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [26]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [27]:
df.loc[['A'],['W']]

   W
A  2

In [28]:
df.loc[['A','C'],'W']

A    2
C    2
Name: W, dtype: int32

In [29]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [30]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [31]:
df [df > 0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [32]:
# NOTE: NaN means Not a Number

In [33]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [34]:
df [df['X'] > 0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [35]:
# Displays only column X where X > 0
df [df['X'] > 0]['X']

A    79
C    21
E    49
Name: X, dtype: int32

In [36]:
# Displays only column W where X > 0
df[df['X'] > 0]['W']

A     2
C     2
E    30
Name: W, dtype: int32

In [37]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [38]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [39]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [40]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [41]:
new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [42]:
df['States'] = new_ind

In [43]:
df['States']

A    CA
B    NY
C    WY
D    OR
E    CO
Name: States, dtype: object

In [44]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [45]:
# Now, lets say we want the States column to be our index

In [46]:
df_1 = df.set_index(['States'])

In [47]:
df_1

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [48]:
# NOTE: df .columns

In [49]:
df_1.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [50]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int32
 1   X       5 non-null      int32
 2   Y       5 non-null      int32
 3   Z       5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [51]:
df.dtypes

W          int32
X          int32
Y          int32
Z          int32
States    object
dtype: object